groupmates = [
 {
 "name": "Александр",
 "surname": "Иванов",
 "exams": ["Информатика", "ЭЭиС", "Web"],
 "marks": [4, 3, 5]
 },
 {
 "name": "Иван",
 "surname": "Петров",
 "exams": ["История", "АиГ", "КТП"],
 "marks": [4, 4, 4]
 },
 {
 "name": "Кирилл",
 "surname": "Смирнов",
 "exams": ["Философия", "ИС", "КТП"],
 "marks": [5, 5, 5]
 },
 {
 "name": "Владимир",
 "surname": "Путинов",
 "exams": ["Физра", "ИС", "ОБЖ"],
 "marks": [4, 5, 2]
 },
 {
 "name": "Дональд",
 "surname": "Дак",
 "exams": ["Биология", "Обществознание", "КТП"],
 "marks": [5, 3, 5]
 }
]